InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТК_НастройкиТСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТК_НастройкиТСД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиТСД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиТСД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Инвентаризация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Инвентаризация</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваровКомпании</xr:Item>
				<xr:Item>AccumulationRegister.ПриходованиеТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровКомпании</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РевизионнаяИнвентаризация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерRB</Name>
					<Comment>Номер Open Store</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоИнвентаризации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОтборов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенИтогов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнвентаризации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТК_ТипыИнвентаризаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Comment>Сотрудник, заключивший сделку с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаТСД</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ТК_ЗадачаТСД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Таблица товаров и услуг</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКнижн</Name>
							<Comment>Расчетное (по базе данных) количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Comment>Фактическое количество товаров на складе</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество разницы. По этому количеству будут производиться движения.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ЗначениеНастроекПовтИсп/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает валюту Управленческого Учета
// Если переданная в качестве параметра валюта уже заполнена - возвращает ее.
// Если валюта не передана в качестве параметра или передан пустой,
// валюту РУ. Если валюта РУ не заполнена - возвращает пустую ссылку на валюту
//
// Параметры:
// Валюта - СправочникСсылка.Валюты - Валюта, которую нужно заполнить
//
// Возвращаемое значение:
//	СправочникСсылка.Валюты
//
Функция ПолучитьВалютуУправленческогоУчета(Знач Валюта = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Возврат Константы.ВалютаУправленческогоУчета.Получить();
	Иначе
		Возврат Валюта;
	КонецЕсли;
	
КонецФункции // ПолучитьВалютуУправленческогоУчета()

// Возвращает валюту регламентированного учета
// Если переданная в качестве параметра валюта уже заполнена - возвращает ее.
// Если валюта не передана в качестве параметра или передан пустой,
// валюту РУ. Если валюта РУ не заполнена - возвращает пустую ссылку на валюту
//
// Параметры:
// Валюта - СправочникСсылка.Валюты - Валюта, которую нужно заполнить
//
// Возвращаемое значение:
//	СправочникСсылка.Валюты
//
Функция ПолучитьВалютуРегламентированногоУчета(Знач Валюта = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Возврат Константы.ВалютаРегламентированногоУчета.Получить();
	Иначе
		Возврат Валюта;
	КонецЕсли;
	
КонецФункции // ПолучитьВалютуРегламентированногоУчета()

// Получает подразделение выбранного пользователя.
//
// Параметры:
//	Пользователь - СправочникСсылка.Пользователи - Текущий пользователь
//
// Возвращаемое значение:
//	СправочникСсылка.Подразделения - Подразделение пользователя
//
Функция ПодразделениеПользователя(Пользователь, Подразделение = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Подразделение = Справочники.Пользователи.ПолучитьРеквизитыПользователя(Пользователь).Подразделение;
	КонецЕсли;
	
	Возврат Подразделение;
	
КонецФункции // ПодразделениеПользователя()

Функция ПолучитьНастройкуПодразделения(Подразделение) Экспорт 
	Возврат	Подразделение.ИспользоватьПротоколыСогласованныхЦен;
КонецФункции

// Функция возвращает значение по умолчанию для передаваемого пользователя и настройки.
//
// Параметры:
//  Пользователь - текущий пользователь программы
//  Настройка    - признак, для которого возвращается значение по умолчанию
//
// Возвращаемое значение:
//  Значение по умолчанию для настройки.
//
Функция ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, Настройка, ПустоеЗначение = Неопределено,ЗначениеНастройки = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
		Возврат ЗначениеНастройки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Настройка"   , ПланыВидовХарактеристик.НастройкиПользователей[Настройка]);
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК РегистрЗначениеПрав
	|
	|ГДЕ
	|	Пользователь = &Пользователь
	| И Настройка    = &Настройка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ПустоеЗначение = Неопределено Тогда
		ПустоеЗначение = ПланыВидовХарактеристик.НастройкиПользователей[Настройка].ТипЗначения.ПривестиЗначение();
	КонецЕсли;
	
	Если Выборка.Количество() = 0 Тогда
		
		Возврат ПустоеЗначение;
		
	ИначеЕсли Выборка.Следующий() Тогда
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат ПустоеЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;
		
	Иначе
		Возврат ПустоеЗначение;
		
	КонецЕсли;
	
КонецФункции // ПолучитьЗначениеПоУмолчаниюПользователя()


// Функция возвращает значение по умолчанию для тсд объекта.
//
// Параметры:
//  ТорговаяПлощадка - торговая площадка ТСД
//  Настройка    - признак, для которого возвращается значение по умолчанию
//
// Возвращаемое значение:
//  Значение по умолчанию для настройки.
//
Функция ПолучитьЗначениеНастройкиТСД(ТорговаяПлощадка, Настройка, ПустоеЗначение = Неопределено,ЗначениеНастройки = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
		Возврат ЗначениеНастройки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	Запрос.УстановитьПараметр("Настройка"   , ПланыВидовХарактеристик.НастройкиТСД[Настройка]);
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Значение
	|ИЗ
	|	РегистрСведений.ТК_НастройкиТСД КАК РегистрЗначениеНастройки
	|
	|ГДЕ
	|	ТорговаяПлощадка = &ТорговаяПлощадка
	| И Настройка    = &Настройка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ПустоеЗначение = Неопределено Тогда
		ПустоеЗначение = ПланыВидовХарактеристик.НастройкиТСД[Настройка].ТипЗначения.ПривестиЗначение();
	КонецЕсли;
	
	Если Выборка.Количество() = 0 Тогда
		
		Возврат ПустоеЗначение;
		
	ИначеЕсли Выборка.Следующий() Тогда
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат ПустоеЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;
		
	Иначе
		Возврат ПустоеЗначение;
		
	КонецЕсли;
	
КонецФункции // ПолучитьЗначениеПоУмолчаниюПользователя()



Функция ПолучитьХозОперацииДокумента(ТипДокумента)Экспорт
	
	МассивОпераций = Новый Массив;
	
	Если ТипДокумента = "АссортиментныйКомитет" Тогда
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ВводНовогоТовараВАссортимент);
		МассивОпераций.Добавить(Справочники.ХозОперации.ВводТоваровВАссортимент);
		МассивОпераций.Добавить(Справочники.ХозОперации.ВыводТоваровИзАссортимента);
		МассивОпераций.Добавить(Справочники.ХозОперации.РаспродажаСПоследующимВыводомИзАссортимента);
		
	ИначеЕсли ТипДокумента = "ИзменениеАссортимента" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ВводТоваровВАссортимент);
		МассивОпераций.Добавить(Справочники.ХозОперации.ВыводТоваровИзАссортимента);
		МассивОпераций.Добавить(Справочники.ХозОперации.РаспродажаСПоследующимВыводомИзАссортимента);
		
	ИначеЕсли ТипДокумента = "ПротоколСогласованияЦен" Тогда 		
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ПротоколСогласованияЦен);
		МассивОпераций.Добавить(Справочники.ХозОперации.ПротоколСогласованияЦенАкция);
		
		
	ИначеЕсли ТипДокумента = "ИзменениеЦен" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ИзменениеЦен);
		
	ИначеЕсли ТипДокумента = "ПоступлениеТоваров" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ПоступлениеТоваров);		
		МассивОпераций.Добавить(Справочники.ХозОперации.ПоступлениеТоваровТранзиты);
		
	ИначеЕсли ТипДокумента = "ЧекККМ" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.Чек);
		МассивОпераций.Добавить(Справочники.ХозОперации.ЧекНаВозврат);
		
	ИначеЕсли ТипДокумента = "ПеремещениеТоваров" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ПеремещениеТоваров);
		МассивОпераций.Добавить(Справочники.ХозОперации.ПеремещениеТоваровВФилиал);
		МассивОпераций.Добавить(Справочники.ХозОперации.ПеремещениеТоваровИзФилиала);
		
	ИначеЕсли ТипДокумента = "СписаниеТоваров" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.СписаниеТоваров);
		МассивОпераций.Добавить(Справочники.ХозОперации.СписаниеДополнительныхМатериалов);
		
	ИначеЕсли ТипДокумента = "ВозвратПоставщику" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ВозвратТоваровПоставщику);
		МассивОпераций.Добавить(Справочники.ХозОперации.ВозвратТоваровПоставщикуТранзиты);
		
	ИначеЕсли ТипДокумента = "РеализацияТоваров" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.РеализацияТоваров);
		МассивОпераций.Добавить(Справочники.ХозОперации.РеализацияТоваровРозница);
		МассивОпераций.Добавить(Справочники.ХозОперации.РеализацияТоваровСписание);
		МассивОпераций.Добавить(Справочники.ХозОперации.АктОбОказанииУслуг);
		
	ИначеЕсли ТипДокумента = "ВозвратОтПокупателя" Тогда
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ВозвратТоваровОтПокупателя);		
		
	ИначеЕсли ТипДокумента = "Инвентаризация" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ИнвентаризацияТоваров);
		
	ИначеЕсли ТипДокумента = "ЗаказПоставщику" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПоставщику);
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПоставщикуВнутренний);
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПоставщикуТранзиты);
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПоставщикуКонсолидированный);
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПоставщикуТСД);
		
	ИначеЕсли ТипДокумента = "ЗаказПокупателя" Тогда 		
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПокупателя);
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПокупателяФизОбмен);
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПокупателяВнутренний);
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПокупателяВнутреннийПроизводство);
		
	ИначеЕсли ТипДокумента = "РезервированиеЗаказовПокупателя" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.РезервированиеПокупателя);
		
	ИначеЕсли ТипДокумента = "ИзменениеПараметровСистемыЗаказов" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаПараметровСистемыЗаказов);
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаПараметровСистемыЗаказовВыборочная);
		
	ИначеЕсли ТипДокумента = "ПересортицаТоваров" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ПересортицаТоваров);
		МассивОпераций.Добавить(Справочники.ХозОперации.ПеретариваниеТоваров);
		МассивОпераций.Добавить(Справочники.ХозОперации.ПересортицаПоЗакрытиюСмены);
		МассивОпераций.Добавить(Справочники.ХозОперации.ПонижениеСортности);
		
	ИначеЕсли ТипДокумента = "ПриходныйКассовыйОрдер" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ПриходныйКассовыйОрдер);
		
	ИначеЕсли ТипДокумента = "РасходныйКассовыйОрдер" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.РасходныйКассовыйОрдер);
		
	ИначеЕсли ТипДокумента = "ПоступлениеБезналичныхДенежныхСредств" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.БанковскаяВыпискаПоступление);
		
	ИначеЕсли ТипДокумента = "СписаниеБезналичныхДенежныхСредств" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.БанковскаяВыпискаРасход);
		
	ИначеЕсли ТипДокумента = "Рецептура" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.Рецептура);
		
	ИначеЕсли ТипДокумента = "ВыпускПродукции" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ВыпускПродукции);
		МассивОпераций.Добавить(Справочники.ХозОперации.ВыпускПродукцииСРеализацией);
		МассивОпераций.Добавить(Справочники.ХозОперации.ВыпускПродукцииСПеремещением);
		
	ИначеЕсли ТипДокумента = "ЗаказПокупателяКазначейство" Тогда
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПокупателяКазначейство);
		
	ИначеЕсли ТипДокумента = "ГрафикЗаказов" Тогда
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаГрафикаЗаказа);
		
	ИначеЕсли ТипДокумента = "ГрафикИнвентаризаций" Тогда
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаГрафикИнвентаризаций);
		
	ИначеЕсли ТипДокумента = "ОптимальноеКоличествоНоменклатуры" Тогда
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаДопустимогоКоличестваНоменклатуры);
		
	ИначеЕсли ТипДокумента = "КорректировкаДолга" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.КорректировкаДолга);
		
	ИначеЕсли ТипДокумента = "ТК_НалоговаяНакладная" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.НалоговаяНакладная);
		МассивОпераций.Добавить(Справочники.ХозОперации.НалоговаяНакладнаяАктУслуг);
		МассивОпераций.Добавить(Справочники.ХозОперации.НалоговаяНакладнаяОбыкновенняПродажа);
		МассивОпераций.Добавить(Справочники.ХозОперации.НалоговаяНакладнаяРозничнаяПродажа);
		МассивОпераций.Добавить(Справочники.ХозОперации.НалоговаяНакладнаяРозничнаяПродажаНеОблагаемая);
		МассивОпераций.Добавить(Справочники.ХозОперации.НалоговаяНакладнаяСводнаяКомпенсирующая);
		
	ИначеЕсли ТипДокумента = "НазначениеСкидок" Тогда
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаСкидки);
		МассивОпераций.Добавить(Справочники.ХозОперации.ОтменаСкидки);
		
	ИначеЕсли ТипДокумента = "ТК_Приложение2КНалоговойНакладной" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.Приложение2КНалоговойНакладной);	
		//МассивОпераций.Добавить(Справочники.ХозОперации.Приложение2КНалоговойНакладнойОблагаемыеОперацииВозврат);
		МассивОпераций.Добавить(Справочники.ХозОперации.Приложение2КНалоговойНакладнойИтоговаяРозницаОблагаемыеОперацииВозврат);				
		
	ИначеЕсли ТипДокумента = "ТК_УстановкаКвотНаОтгрузку" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаКвотНаОтгрузку);
		МассивОпераций.Добавить(Справочники.ХозОперации.ОтменаКвотНаОтгрузку);
		
	ИначеЕсли ТипДокумента = "КонсолидированныеОстаткиОрганизации" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.КонсолидированныеПоступленияОрганизации);
		МассивОпераций.Добавить(Справочники.ХозОперации.КонсолидированныеОстаткиОрганизации);
		
	ИначеЕсли ТипДокумента = "ТК_УстановкаМаркетинга" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаМаркетинга);
		
	ИначеЕсли ТипДокумента = "РасчетБонусов" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.РасчетБонусов);
		
	ИначеЕсли ТипДокумента = "ТК_Взаимозачет" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.Взаимозачет);	
		
	ИначеЕсли ТипДокумента = "КорректировкаЗаказаПокупателя" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.КорректировкаЗаказаПокупателя);
		
	ИначеЕсли ТипДокумента = "СчетНаОплату" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.СчетНаОплату);
		
	ИначеЕсли ТипДокумента = "Антимонопольный" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.Антимонопольный);
		
	ИначеЕсли ТипДокумента = "КорректировкаПартийТоваров" Тогда	
		
		МассивОпераций.Добавить(Справочники.ХозОперации.КорректировкаУчетныхДанных);
		
	ИначеЕсли ТипДокумента = "ТК_Переработка" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.Переработка);
		
	ИначеЕсли ТипДокумента = "ТК_ОприходованиеТоваров" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ОприходованиеТоваров);
		
	ИначеЕсли ТипДокумента = "ТК_Планирование" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаПланирования);
		
	ИначеЕсли ТипДокумента = "ТК_ПравилаСписанияДопМатериалов" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаПравилаСписанияДопМатериалов);
		МассивОпераций.Добавить(Справочники.ХозОперации.ОтменаПравилаСписанияДопМатериалов);
		
	ИначеЕсли ТипДокумента = "НачислениеКоммунальныхУслуг" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.НачислениеКоммунальныхУслуг);
		МассивОпераций.Добавить(Справочники.ХозОперации.ВводНачальныхПоказанийСчетчиков);
		
	ИначеЕсли ТипДокумента = "ТК_ЗаявкаНаВозвратПоставщику" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаявкаНаВозвратПоставщику);
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаявкаНаВозвратПоставщикуТранзиты);
		
	КонецЕсли;
	
	
	Возврат МассивОпераций
	
КонецФункции


// Возвращает массив диапазонов штучных штрихкодов.
//
// Параметры:
//		Нет
// Возвращаемое значение:
//		Массив - диапазоны штрихкодов
//
Функция ДиапазоныШтучныхШтрихкодов() Экспорт
	
	ДиапазоныШтучныхШтрихкодов = Новый Массив;
	
	НастройкиДиапазоновШтрихкодов = РегистрыСведений.ШтрихкодыНоменклатуры.НастройкиДиапазоновШтрихкодов();
	Для Каждого Настройка Из НастройкиДиапазоновШтрихкодов Цикл
		Если Не Настройка.Весовой Тогда
			ДиапазоныШтучныхШтрихкодов.Добавить(Настройка);
		КонецЕсли
	КонецЦикла;
	
	Возврат ДиапазоныШтучныхШтрихкодов;
	
КонецФункции


Функция ПолучитьДопСвойствоПоИмени(ИмяСвойства) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Имя = &Имя";
	
	Запрос.УстановитьПараметр("Имя", ИмяСвойства);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОбластьТочкиДоставки(ТочкаДоставки) Экспорт 
	
	Возврат ТочкаДоставки.Город.Область;
	
КонецФункции

Функция ЭтоВнутреннийКонтрагент(Контрагент) Экспорт 
	Возврат Справочники.Контрагенты.ЭтоВнутреннийКонтрагент(Контрагент);	
КонецФункции

Функция ПолучитьТаблицуУчетаХарактеристик(СкладКомпании) Экспорт 
	Возврат Справочники.СкладыКомпании.ПолучитьТаблицуУчетаХарактеристик(СкладКомпании);
КонецФункции

Функция ДоступноРазделениеТоваровПоОрганизациям(ТорговаяПлощадка) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ТорговыеПлощадки.РазделятьТоварыПоОрганизациям КАК РазделятьТоварыПоОрганизациям
	|ИЗ
	|	Справочник.ТорговыеПлощадки КАК ТорговыеПлощадки
	|ГДЕ
	|	ТорговыеПлощадки.Ссылка = &ТорговаяПлощадка
	|	И ТорговыеПлощадки.РазделятьТоварыПоОрганизациям = ИСТИНА";
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

#КонецОбласти

#Область ФункцииПечати

Функция ПолучитьУсловияВидимостиКомандПечати(ИдентификаторКоманды, МенеджерПечати) Экспорт 
	
	МассивУсловий = Новый Массив;
	
	Если ИдентификаторКоманды = "Пустографка" И МенеджерПечати = "Документ.Инвентаризация" Тогда 
		
		МассивСкладовПустографки = Новый Массив;
		МассивСкладовПустографки.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("O460")); //Энгельса, 33 - Торговый зал (Основа Инфо)
		
		УсловиеВидимости = Новый Структура("Реквизит, ВидСравнения, Значение",
		"СкладКомпании",
		ВидСравнения.ВСписке,
		МассивСкладовПустографки);
		
		МассивУсловий.Добавить(УсловиеВидимости);								
		
	КонецЕсли;
	
	Возврат МассивУсловий;
	
КонецФункции

#КонецОбласти
